In [3]:
import pandas as pd
import sqlite3

In [6]:
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]
print(names)
print(births)

['Bob', 'Jessica', 'Mary', 'John', 'Mel']
[968, 155, 77, 578, 973]

In [9]:
StudentBirthData = list(zip(names,births))
StudentBirthData

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [11]:
# df is the DataFrame object , it act as the database handler and store the data like table and excel sheet
df = pd.DataFrame(data = StudentBirthData , columns=['Names','Birth'] )
df

     Names  Birth
0      Bob    968
1  Jessica    155
2     Mary     77
3     John    578
4      Mel    973